#### DataFrame 생성하기
 - 일반적으로 분석을 위한 데이터는 다른 데이터 소스(database, 외부 파일)을 통해 dataframe을 생성
 - 여기서는 실습을 통해, dummy 데이터를 생성하는 방법을 다룰 예정

In [22]:
import numpy as np
import pandas as pd

#### dictionary로 부터 생성하기
 - dict의 key -> column

In [2]:
data = {'a':100, 'b':200, 'c':300}
pd.DataFrame(data, index=['x','y','z'])

     a    b    c
x  100  200  300
y  100  200  300
z  100  200  300

In [3]:
data = {'a':[1,2,3], 'b':[4,5,6], 'c':[10,11,12]}
pd.DataFrame(data, index=[0,1,2])

   a  b   c
0  1  4  10
1  2  5  11
2  3  6  12

#### Series로 부터 생성하기
 - 각 Series의 인덱스 -> column

In [4]:
a = pd.Series([100,200,300],['a','b','d'])
b = pd.Series([101,201,301],['a','b','f'])
c = pd.Series([110,220,330],['a','b','c'])
pd.DataFrame([a,b,c],index=[100,101,102])

         a      b      d      f      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  220.0    NaN    NaN  330.0

깃허브 소스코드

https://github.com/wesm/pydata-book/blob/2nd-edition/ch05.ipynb

In [5]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

#### 컬럼의 순서를 원하는 순서대로 지정가능

In [7]:
# 현재 순서가  state -> year ->pop
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame = pd.DataFrame(data, columns=['year','state','pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [10]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns=['year','state','pop', 'debt'],
                     index=['one','two','three','four','five','six'])

In [11]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [12]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [13]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [14]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [15]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [18]:
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [19]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [20]:
frame2['debt'] = 11.0
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  11.0
two    2001    Ohio  1.7  11.0
three  2002    Ohio  3.6  11.0
four   2001  Nevada  2.4  11.0
five   2002  Nevada  2.9  11.0
six    2003  Nevada  3.2  11.0

In [23]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [24]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [25]:
frame2['eastern'] = (frame2.state=='Ohio')
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [26]:
del frame2['eastern']
fram2.columns

In [28]:
frame2.eastern = (frame2.state=='Ohio')
frame2

C:\Users\HKIT\AppData\Local\Temp\ipykernel_10100\1921349268.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  frame2.eastern = (frame2.state=='Ohio')

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

#### Dropping Entries from an Axis

In [38]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [32]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [39]:
data1 = data.drop(['Ohio','Colorado'])
data1

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [41]:
#data2 = data.drop('two',axis=1)
data2 = data.drop('two',axis='columns')
data2

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [42]:
data2 = data.drop(['two','four'],axis='columns')
data2

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [45]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [47]:
obj.drop('c',inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### Indexing, Selection, and Filtering

In [53]:
my_index =['a','b','c','d']
obj = pd.Series(np.arange(4.), my_index)
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [54]:
for index in my_index:
    print(f"obj['{index}'] : {obj[index]}")

obj['a'] : 0.0
obj['b'] : 1.0
obj['c'] : 2.0
obj['d'] : 3.0

In [56]:
obj['b']

1.0

In [57]:
for i in range(len(obj)):
    print(f'obj[{i}] : {obj[i]}')

obj[0] : 0.0
obj[1] : 1.0
obj[2] : 2.0
obj[3] : 3.0

In [58]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [59]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [61]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [62]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [63]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [64]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [65]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### column데이터 출력

In [72]:
for column in data.columns:
    print(f"data['{column}'] ==>")
    print(data[column])
    print()

data['one'] ==>
Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

data['two'] ==>
Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

data['three'] ==>
Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

data['four'] ==>
Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [73]:
data[['one','three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [74]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [76]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### loc과 iloc으로 선택하기

In [77]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [79]:
data.index

Index(['Ohio', 'Colorado', 'Utah', 'New York'], dtype='object')

In [80]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [86]:
for index in data.index:
    print(f"data.loc['{index}'] ==>")
    print(data.loc[index])
    print()

data.loc['Ohio'] ==>
one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

data.loc['Colorado'] ==>
one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

data.loc['Utah'] ==>
one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

data.loc['New York'] ==>
one      12
two      13
three    14
four     15
Name: New York, dtype: int32

In [89]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [88]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [91]:
for i in range(len(data.index)):
    print(f"data.iloc[{i}] ==>")
    print(data.iloc[i])
    print()

data.iloc[0] ==>
one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

data.iloc[1] ==>
one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

data.iloc[2] ==>
one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

data.iloc[3] ==>
one      12
two      13
three    14
four     15
Name: New York, dtype: int32

In [92]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [93]:
data.iloc[2, [3,1,2]]

four     11
two       9
three    10
Name: Utah, dtype: int32

In [95]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.iloc[[1,2]]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [98]:
data.iloc[[1,2],[3,2,1]]

          four  three  two
Colorado     7      6    5
Utah        11     10    9

In [99]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [100]:
data.iloc[2,2]

10

In [102]:
data.loc['Utah','three']

10

In [103]:
data.loc[:'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [104]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [105]:
data.iloc[:,:3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [107]:
data.iloc[:,:3][data['three'] >10]

          one  two  three
New York   12   13     14

#### 정수 인덱스(Integer Indexes)

In [110]:
ser = pd.Series(np.arange(3.))

In [111]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [112]:
ser[-1]

KeyError: -1

In [113]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [114]:
ser2[-1]

2.0

In [115]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [116]:
ser[:1]

0    0.0
dtype: float64

In [117]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [118]:
ser.iloc[:1]

0    0.0
dtype: float64

#### Arithmetic and Data Alignment

In [120]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [121]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [122]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [124]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [125]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [127]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})

In [128]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

#### 산술연산 메소드에 채워넣을 값 지정하기
(Arithmetic methods with fill values)

In [129]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [130]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [131]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [132]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [133]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [134]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [136]:
df1.rdiv(1) # 1/df1 과 동일

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [139]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0